In [28]:
import pandas as pd 
import os

In [29]:
filepath_1 = os.path.join("..","outputs","salary.csv")

In [30]:
salary_df = pd.read_csv(filepath_1)

In [31]:
rename_salary = salary_df.rename(columns={"player_name":"PLAYER_NAME","salary":"SALARY"})
clean_salary_df = rename_salary

In [32]:
clean_salary_df['PLAYER_NAME'] = clean_salary_df['PLAYER_NAME'].str.replace('.','')
clean_salary_df

           PLAYER_NAME         SALARY
0        Stephen Curry  $37,457,154
1    Russell Westbrook  $35,654,150
2         LeBron James  $35,654,150
3           Chris Paul  $35,654,150
4           Kyle Lowry  $32,700,000
..                 ...            ...
495      Tarik Phillip       $9,474
496    Duncan Robinson       $9,474
497        Mitch Creek       $9,474
498      Kendrick Nunn       $4,737
499        Theo Pinson       $4,737

[500 rows x 2 columns]

In [33]:
filepath_2 = os.path.join("..","Resources","players.csv")

In [34]:
player_df = pd.read_csv(filepath_2)
player_df['PLAYER_NAME'] = player_df['PLAYER_NAME'].str.replace('.','')
player_df

           PLAYER_NAME     TEAM_ID  PLAYER_ID  SEASON
0        Royce O'Neale  1610612762    1626220    2019
1     Bojan Bogdanovic  1610612762     202711    2019
2          Rudy Gobert  1610612762     203497    2019
3     Donovan Mitchell  1610612762    1628378    2019
4          Mike Conley  1610612762     201144    2019
...                ...         ...        ...     ...
7223       Lanny Smith  1610612758     201831    2009
7224     Warren Carter  1610612752     201999    2009
7225      Bennet Davis  1610612751     201834    2009
7226    Brian Hamilton  1610612751     201646    2009
7227   Wesley Matthews  1610612762     500032    2009

[7228 rows x 4 columns]

In [35]:
players = player_df.loc[player_df['SEASON'] == 2018]

In [36]:
merge_salary_df = pd.merge(clean_salary_df, players, on="PLAYER_NAME", how = 'inner')

In [37]:
cleaned_salary_df = merge_salary_df.drop_duplicates(subset=['PLAYER_NAME'])

In [38]:
cleaned_salary_df

           PLAYER_NAME         SALARY     TEAM_ID  PLAYER_ID  SEASON
0        Stephen Curry  $37,457,154    1610612744     201939    2018
1    Russell Westbrook  $35,654,150    1610612760     201566    2018
2         LeBron James  $35,654,150    1610612747       2544    2018
3           Chris Paul  $35,654,150    1610612745     101108    2018
4           Kyle Lowry  $32,700,000    1610612761     200768    2018
..                 ...            ...         ...        ...     ...
588    Jonathan Gibson      $17,092    1610612738    1626780    2018
589        Yante Maten      $14,211    1610612748    1628999    2018
590    Duncan Robinson       $9,474    1610612748    1629130    2018
591      Kendrick Nunn       $4,737    1610612744    1629134    2018
592        Theo Pinson       $4,737    1610612751    1629033    2018

[445 rows x 5 columns]

In [39]:
cleaned_salary_df.to_csv("../outputs/salary_clean.csv", index=False)

In [40]:
clean_salary_df.loc[clean_salary_df.duplicated(), :]

                 PLAYER_NAME     SALARY
435            Cameron Payne  $85,458
436           Terrence Jones  $85,458
437             John Jenkins  $85,458
441            Deyonta Davis  $85,458
447  Michael Carter-Williams  $85,458
448            Isaiah Canaan  $85,458
449            Isaiah Canaan  $85,458
450             Corey Brewer  $85,458
451             Corey Brewer  $85,458
456               Quincy Acy  $85,458
458            Bruno Caboclo  $85,458
473               BJ Johnson  $47,371
478               BJ Johnson  $47,371
481              Mitch Creek  $47,371
483             Justin Bibbs  $47,371
484              Mitch Creek  $47,371
487            Emanuel Terry  $47,371